# core taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# General system tools
brew "curl"
brew "geoip"
brew "gnu-getopt"
brew "grep"
brew "jq"
brew "netmask"
brew "starship"
brew "telnet"
brew "thefuck"
brew "tree"
brew "vim"
brew "wget"
brew "yq"
brew "zsh-completions"

# Code related tools
brew "markdownlint-cli"
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
cask "visual-studio-code"
cask "tuple"

# Python tools
brew "pyenv"
brew "pyenv-virtualenv"

# Ruby tools
brew "rbenv"

# AWS stuff
brew "aws-iam-authenticator"
brew "awscli"
cask "aws-vault"
cask "aws-vpn-client"

# Docker tools
brew "dive"
cask "rancher"


# Git stuff
brew "gh"
brew "gist"

# Golang stuff
brew "go"
brew "golangci-lint"
brew "gomplate"

# Kubernetes stuff
brew "helm"
brew "k9s"

# Hashicorp tools
brew "vault", restart_service: true

# 1pass
cask "1password"
cask "1password-cli"

# Desktop tools
cask "bartender"
cask "box-sync"
cask "box-tools"
cask "discord"
cask "font-fira-code"
cask "gpg-suite"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "notion"
cask "rectangle-pro"
cask "spotify"
cask "warp"
cask "yubico-yubikey-manager"
cask "zoom"

# Terraform stuff
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tgenv"

# Jira
tap "ankitpokhrel/jira-cli"
brew "ankitpokhrel/jira-cli/jira-cli"

# Spacelift
tap "spacelift-io/spacelift"
brew "spacelift-io/spacelift/spacectl"